zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/MCXA577/drivers/fsl_clock.h
/*
 * Copyright 2025-2026 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _FSL_CLOCK_H_
#define _FSL_CLOCK_H_

#include "fsl_common.h"

/*! @addtogroup clock */
/*! @{ */

/*! @file */

/*******************************************************************************
 * Definitions
 *****************************************************************************/

/*! @name Driver version */
/*@{*/
/*! @brief CLOCK driver version 2.0.1. */
#define FSL_CLOCK_DRIVER_VERSION (MAKE_VERSION(2, 0, 1))
/*@}*/

/*! @brief Configure whether driver controls clock
 *
 * When set to 0, peripheral drivers will enable clock in initialize function
 * and disable clock in de-initialize function. When set to 1, peripheral
 * driver will not control the clock, application could control the clock out of
 * the driver.
 *
 * @note All drivers share this feature switcher. If it is set to 1, application
 * should handle clock enable and disable for all drivers.
 */
#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL))
#define FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL 0U
#endif

/* Definition for delay API in clock driver, users can redefine it to the real
 * application. */
#ifndef SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY
#define SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY (240000000U)
#endif

/*! @brief Clock gate name used for CLOCK_EnableClock/CLOCK_DisableClock. */
/*------------------------------------------------------------------------------
 clock_ip_name_t definition:
------------------------------------------------------------------------------*/
#define CLK_GATE_REG_OFFSET(value) (((uint32_t)(value)) >> 16U)
#define CLK_GATE_BIT_SHIFT(value)  (((uint32_t)(value)) & 0x0000FFFFU)

/*! @brief Clock gate name used for CLOCK_EnableClock/CLOCK_DisableClock. */
typedef enum _clock_ip_name
{
    kCLOCK_GateINPUTMUX0     = ((0x0U << 16U) | (0U)),   /*!< Clock gate name: INPUTMUX0     */
    kCLOCK_GateFREQME        = ((0x0U << 16U) | (1U)),   /*!< Clock gate name: FREQME        */
    kCLOCK_GateCTIMER0       = ((0x0U << 16U) | (2U)),   /*!< Clock gate name: CTIMER0       */
    kCLOCK_GateCTIMER1       = ((0x0U << 16U) | (3U)),   /*!< Clock gate name: CTIMER1       */
    kCLOCK_GateCTIMER2       = ((0x0U << 16U) | (4U)),   /*!< Clock gate name: CTIMER2       */
    kCLOCK_GateCTIMER3       = ((0x0U << 16U) | (5U)),   /*!< Clock gate name: CTIMER3       */
    kCLOCK_GateCTIMER4       = ((0x0U << 16U) | (6U)),   /*!< Clock gate name: CTIMER4       */
    kCLOCK_GateUTICK0        = ((0x0U << 16U) | (7U)),   /*!< Clock gate name: UTICK0        */
    kCLOCK_GateWWDT0         = ((0x0U << 16U) | (8U)),   /*!< Clock gate name: WWDT0         */
    kCLOCK_GateWWDT1         = ((0x0U << 16U) | (9U)),   /*!< Clock gate name: WWDT1         */
    kCLOCK_GateDMA0          = ((0x0U << 16U) | (10U)),  /*!< Clock gate name: DMA0          */
    kCLOCK_GateDMA1          = ((0x0U << 16U) | (11U)),  /*!< Clock gate name: DMA1          */
    kCLOCK_GateAOI0          = ((0x0U << 16U) | (12U)),  /*!< Clock gate name: AOI0          */
    kCLOCK_GateCRC0          = ((0x0U << 16U) | (14U)),  /*!< Clock gate name: CRC0          */
    kCLOCK_GateEIM0          = ((0x0U << 16U) | (15U)),  /*!< Clock gate name: EIM0          */
    kCLOCK_GateERM0          = ((0x0U << 16U) | (16U)),  /*!< Clock gate name: ERM0          */
    kCLOCK_GateFLEXIO0       = ((0x0U << 16U) | (17U)),  /*!< Clock gate name: FLEXIO0       */
    kCLOCK_GateLPI2C0        = ((0x0U << 16U) | (19U)),  /*!< Clock gate name: LPI2C0        */
    kCLOCK_GateLPI2C1        = ((0x0U << 16U) | (20U)),  /*!< Clock gate name: LPI2C1        */
    kCLOCK_GateLPI2C2        = ((0x0U << 16U) | (21U)),  /*!< Clock gate name: LPI2C2        */
    kCLOCK_GateLPI2C3        = ((0x0U << 16U) | (22U)),  /*!< Clock gate name: LPI2C3        */
    kCLOCK_GateLPI2C4        = ((0x0U << 16U) | (23U)),  /*!< Clock gate name: LPI2C4        */
    kCLOCK_GateLPUART0       = ((0x0U << 16U) | (25U)),  /*!< Clock gate name: LPUART0       */
    kCLOCK_GateLPUART1       = ((0x0U << 16U) | (26U)),  /*!< Clock gate name: LPUART1       */
    kCLOCK_GateLPUART2       = ((0x0U << 16U) | (27U)),  /*!< Clock gate name: LPUART2       */
    kCLOCK_GateLPUART3       = ((0x0U << 16U) | (28U)),  /*!< Clock gate name: LPUART3       */
    kCLOCK_GateLPUART4       = ((0x0U << 16U) | (29U)),  /*!< Clock gate name: LPUART4       */
    kCLOCK_GateLPUART5       = ((0x0U << 16U) | (30U)),  /*!< Clock gate name: LPUART5       */
    kCLOCK_GateOSTIMER0      = ((0x0U << 16U) | (31U)),  /*!< Clock gate name: OSTIMER0      */
    kCLOCK_GateLPSPI0        = ((0x10U << 16U) | (4U)),  /*!< Clock gate name: LPSPI0        */
    kCLOCK_GateLPSPI1        = ((0x10U << 16U) | (5U)),  /*!< Clock gate name: LPSPI1        */
    kCLOCK_GateLPSPI2        = ((0x10U << 16U) | (6U)),  /*!< Clock gate name: LPSPI2        */
    kCLOCK_GateLPSPI3        = ((0x10U << 16U) | (7U)),  /*!< Clock gate name: LPSPI3        */
    kCLOCK_GateLPSPI4        = ((0x10U << 16U) | (8U)),  /*!< Clock gate name: LPSPI4        */
    kCLOCK_GateLPSPI5        = ((0x10U << 16U) | (9U)),  /*!< Clock gate name: LPSPI5        */
    kCLOCK_GatePORT0         = ((0x10U << 16U) | (10U)), /*!< Clock gate name: PORT0         */
    kCLOCK_GatePORT1         = ((0x10U << 16U) | (11U)), /*!< Clock gate name: PORT1         */
    kCLOCK_GatePORT2         = ((0x10U << 16U) | (12U)), /*!< Clock gate name: PORT2         */
    kCLOCK_GatePORT3         = ((0x10U << 16U) | (13U)), /*!< Clock gate name: PORT3         */
    kCLOCK_GatePORT4         = ((0x10U << 16U) | (14U)), /*!< Clock gate name: PORT4         */
    kCLOCK_GatePORT5         = ((0x10U << 16U) | (15U)), /*!< Clock gate name: PORT5         */
    kCLOCK_GateADC0          = ((0x10U << 16U) | (16U)), /*!< Clock gate name: ADC0          */
    kCLOCK_GateADC1          = ((0x10U << 16U) | (17U)), /*!< Clock gate name: ADC1          */
    kCLOCK_GateCMP0          = ((0x10U << 16U) | (20U)), /*!< Clock gate name: CMP0          */
    kCLOCK_GateDAC0          = ((0x10U << 16U) | (23U)), /*!< Clock gate name: DAC0          */
    kCLOCK_GateDAC1          = ((0x10U << 16U) | (24U)), /*!< Clock gate name: DAC1          */
    kCLOCK_GateVREF0         = ((0x10U << 16U) | (29U)), /*!< Clock gate name: VREF0         */
    kCLOCK_GateTSI0          = ((0x10U << 16U) | (31U)), /*!< Clock gate name: TSI0          */
    kCLOCK_GateI3C0          = ((0x20U << 16U) | (0U)),  /*!< Clock gate name: I3C0          */
    kCLOCK_GateI3C1          = ((0x20U << 16U) | (1U)),  /*!< Clock gate name: I3C1          */
    kCLOCK_GateI3C2          = ((0x20U << 16U) | (2U)),  /*!< Clock gate name: I3C2          */
    kCLOCK_GateI3C3          = ((0x20U << 16U) | (3U)),  /*!< Clock gate name: I3C3          */
    kCLOCK_GateFLEXCAN0      = ((0x20U << 16U) | (4U)),  /*!< Clock gate name: FLEXCAN0      */
    kCLOCK_GateFLEXCAN1      = ((0x20U << 16U) | (5U)),  /*!< Clock gate name: FLEXCAN1      */
    kCLOCK_GateE1588         = ((0x20U << 16U) | (8U)),  /*!< Clock gate name: E1588         */
    kCLOCK_GateRMII          = ((0x20U << 16U) | (9U)),  /*!< Clock gate name: RMII          */
    kCLOCK_GateENET0         = ((0x20U << 16U) | (10U)), /*!< Clock gate name: ENET0         */
    kCLOCK_GateTENBASET_PHY0 = ((0x20U << 16U) | (11U)), /*!< Clock gate name: TENBASET_PHY0 */
    kCLOCK_GateFLEXSPI0      = ((0x20U << 16U) | (12U)), /*!< Clock gate name: FLEXSPI0      */
    kCLOCK_GateSPIFILTER0    = ((0x20U << 16U) | (13U)), /*!< Clock gate name: SPIFILTER0    */
    kCLOCK_GateESPI0         = ((0x20U << 16U) | (14U)), /*!< Clock gate name: ESPI0         */
    kCLOCK_GateUSBHS         = ((0x20U << 16U) | (18U)), /*!< Clock gate name: USBHS          */
    kCLOCK_GateUSBHS_PHY     = ((0x20U << 16U) | (19U)), /*!< Clock gate name: USBHS_PHY      */
    kCLOCK_GateEWM0          = ((0x20U << 16U) | (20U)), /*!< Clock gate name: EWM0          */
    kCLOCK_GateRAMA          = ((0x30U << 16U) | (16U)), /*!< Clock gate name: RAMA          */
    kCLOCK_GateRAMB          = ((0x30U << 16U) | (17U)), /*!< Clock gate name: RAMB          */
    kCLOCK_GateGPIO0         = ((0x30U << 16U) | (20U)), /*!< Clock gate name: GPIO0         */
    kCLOCK_GateGPIO1         = ((0x30U << 16U) | (21U)), /*!< Clock gate name: GPIO1         */
    kCLOCK_GateGPIO2         = ((0x30U << 16U) | (22U)), /*!< Clock gate name: GPIO2         */
    kCLOCK_GateGPIO3         = ((0x30U << 16U) | (23U)), /*!< Clock gate name: GPIO3         */
    kCLOCK_GateGPIO4         = ((0x30U << 16U) | (24U)), /*!< Clock gate name: GPIO4         */
    kCLOCK_GateGPIO5         = ((0x30U << 16U) | (25U)), /*!< Clock gate name: GPIO5         */
    kCLOCK_GateROMC          = ((0x30U << 16U) | (28U)), /*!< Clock gate name: ROMC          */
    kCLOCK_GateSMARTDMA0     = ((0x30U << 16U) | (29U)), /*!< Clock gate name: SMARTDMA0     */
    kCLOCK_GateSECCON        = ((0x40U << 16U) | (16U)), /*!< Clock gate name: SECCON        */
    kCLOCK_GateGLIKEY0       = ((0x40U << 16U) | (17U)), /*!< Clock gate name: GLIKEY0       */
    kCLOCK_GateTDET0         = ((0x40U << 16U) | (18U)), /*!< Clock gate name: TDET0         */
    kCLOCK_GatePKC0          = ((0x40U << 16U) | (19U)), /*!< Clock gate name: PKC0          */
    kCLOCK_GateSGI0          = ((0x40U << 16U) | (20U)), /*!< Clock gate name: SGI0          */
    kCLOCK_GateTRNG0         = ((0x40U << 16U) | (21U)), /*!< Clock gate name: TRNG0         */
    kCLOCK_GateUDF0          = ((0x40U << 16U) | (22U)), /*!< Clock gate name: UDF0          */
    kCLOCK_GateDGDET0        = ((0x40U << 16U) | (23U)), /*!< Clock gate name: DGDET0        */
    kCLOCK_GateITRC0         = ((0x40U << 16U) | (24U)), /*!< Clock gate name: ITRC0         */
    kCLOCK_GateATX0          = ((0x40U << 16U) | (29U)), /*!< Clock gate name: ATX0          */
    kCLOCK_GateMTR           = ((0x40U << 16U) | (30U)), /*!< Clock gate name: MTR           */
    kCLOCK_GateTCU           = ((0x40U << 16U) | (31U)), /*!< Clock gate name: TCU           */
    kCLOCK_GateNotAvail      = (0xFFFFFFFFU),            /*!< Clock gate name: None          */
} clock_ip_name_t;

