zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/MCXA577/drivers/fsl_clock.h
#define kCLOCK_Crc0     kCLOCK_GateCRC0
#define kCLOCK_Ewm0     kCLOCK_GateEWM0
#define kCLOCK_InputMux kCLOCK_GateINPUTMUX0
#define kCLOCK_Smartdma kCLOCK_GateSMARTDMA0

/*! @brief Clock ip name array for AOI. */
#define AOI_CLOCKS {kCLOCK_GateAOI0}
/*! @brief Clock ip name array for CRC. */
#define CRC_CLOCKS {kCLOCK_GateCRC0}
/*! @brief Clock ip name array for CTIMER. */
#define CTIMER_CLOCKS \
    {kCLOCK_GateCTIMER0, kCLOCK_GateCTIMER1, kCLOCK_GateCTIMER2, kCLOCK_GateCTIMER3, kCLOCK_GateCTIMER4}
/*! @brief Clock ip name array for DMA. */
#define DMA_CLOCKS {kCLOCK_GateDMA0, kCLOCK_GateDMA1}
/*! @brief Clock gate name array for EDMA. */
#define EDMA_CLOCKS {kCLOCK_GateDMA0}
/*! @brief Clock ip name array for ERM. */
#define ERM_CLOCKS {kCLOCK_GateERM0}
/*! @brief Clock ip name array for EIM. */
#define EIM_CLOCKS {kCLOCK_GateEIM0}
/*! @brief Clock gate name array for ESPI. */
#define ESPI_CLOCKS {kCLOCK_GateESPI0}
/*! @brief Clock gate name array for ENET. */
#define ETH_CLOCKS {kCLOCK_GateENET0}
/*! @brief Clock gate name array for E1588. */
#define E1588_CLOCKS {kCLOCK_GateE1588}
/*! @brief Clock ip name array for FLEXCAN. */
#define FLEXCAN_CLOCKS {kCLOCK_GateFLEXCAN0, kCLOCK_GateFLEXCAN1}
/*! @brief Clock ip name array for FREQME. */
#define FREQME_CLOCKS {kCLOCK_GateFREQME}
/*! @brief Clock ip name array for FLEXIO. */
#define FLEXIO_CLOCKS {kCLOCK_GateFLEXIO0}
/*! @brief Clock ip name array for FLEXSPI. */
#define FLEXSPI_CLOCKS {kCLOCK_GateFLEXSPI0}
/*! @brief Clock ip name array for GPIO. */
#define GPIO_CLOCKS \
    {kCLOCK_GateGPIO0, kCLOCK_GateGPIO1, kCLOCK_GateGPIO2, kCLOCK_GateGPIO3, kCLOCK_GateGPIO4, kCLOCK_GateGPIO5}
/*! @brief Clock ip name array for GDET. */
#define GDET_CLOCKS {kCLOCK_GateDGDET0}
/*! @brief Clock ip name array for INPUTMUX. */
#define INPUTMUX_CLOCKS {kCLOCK_GateINPUTMUX0}
/*! @brief Clock ip name array for GPIO. */
#define LPCMP_CLOCKS {kCLOCK_GateCMP0}
/*! @brief Clock ip name array for LPADC. */
#define LPADC_CLOCKS {kCLOCK_GateADC0, kCLOCK_GateADC1}
/*! @brief Clock ip name array for LPDAC. */
#define LPDAC_CLOCKS {kCLOCK_GateDAC0, kCLOCK_GateDAC1}
/*! @brief Clock ip name array for LPUART. */
#define LPUART_CLOCKS                                            \
    {kCLOCK_GateLPUART0, kCLOCK_GateLPUART1, kCLOCK_GateLPUART2, \
     kCLOCK_GateLPUART3, kCLOCK_GateLPUART4, kCLOCK_GateLPUART5}
/*! @brief Clock ip name array for LPI2C. */
#define LPI2C_CLOCKS {kCLOCK_GateLPI2C0, kCLOCK_GateLPI2C1, kCLOCK_GateLPI2C2, kCLOCK_GateLPI2C3, kCLOCK_GateLPI2C4}
/*! @brief Clock ip name array for LSPI. */
#define LPSPI_CLOCKS \
    {kCLOCK_GateLPSPI0, kCLOCK_GateLPSPI1, kCLOCK_GateLPSPI2, kCLOCK_GateLPSPI3, kCLOCK_GateLPSPI4, kCLOCK_GateLPSPI5}
/*! @brief Clock ip name array for I3C. */
#define I3C_CLOCKS {kCLOCK_GateI3C0, kCLOCK_GateI3C1, kCLOCK_GateI3C2, kCLOCK_GateI3C3}
/*! @brief Clock ip name array for OSTIMER. */
#define OSTIMER_CLOCKS {kCLOCK_GateOSTIMER0}
/*! @brief Clock ip name array for PORT. */
#define PORT_CLOCKS \
    {kCLOCK_GatePORT0, kCLOCK_GatePORT1, kCLOCK_GatePORT2, kCLOCK_GatePORT3, kCLOCK_GatePORT4, kCLOCK_GatePORT5}
/*! @brief Clock gate name array for RMII. */
#define RMII_CLOCKS {kCLOCK_GateRMII}
/*! @brief Clock ip name array for SPIFILTER. */
#define SPIFILTER_CLOCKS {kCLOCK_GateSPIFILTER0}
/*! @brief Clock ip name array for SMARTDMA. */
#define SMARTDMA_CLOCKS {kCLOCK_GateSMARTDMA0}
/*! @brief Clock ip name array for TRNG. */
#define TRNG_CLOCKS {kCLOCK_GateTRNG0}
/*! @brief Clock ip name array for UTICK. */
#define UTICK_CLOCKS {kCLOCK_GateUTICK0}
/*! @brief Clock ip name array for USBHS. */
#define USB_CLOCKS {kCLOCK_GateUSBHS}
/*! @brief Clock ip name array for USBHSPHY. */
#define USBPHY_CLOCKS {kCLOCK_GateUSBHSPHY}
/*! @brief Clock ip name array for VREF. */
#define VREF_CLOCKS {kCLOCK_GateVREF0}
/*! @brief Clock gate name array for RTC. */
#define RTC_CLOCKS {kCLOCK_GateNotAvail}
/*! @brief Clock gate name array for TSI. */
#define TSI_CLOCKS {kCLOCK_GateTSI0}
/*! @brief Clock gate name array for TENBASET_PHY. */
#define TENBASET_PHY_CLOCKS {kCLOCK_GateTENBASET_PHY0}
/*! @brief Clock ip name array for WWDT. */
#define WWDT_CLOCKS {kCLOCK_GateWWDT0, kCLOCK_GateWWDT1}
/*! @brief Clock name used to get clock frequency. */
typedef enum _clock_name
{
    kCLOCK_MainClk,    /*!< MAIN_CLK                   */
    kCLOCK_CoreSysClk, /*!< Core/system clock(CPU_CLK) */
    kCLOCK_SYSTEM_CLK, /*!< SYSTEM clock/AHB_BUS       */
    kCLOCK_BusClk,     /*!< SYSTEM clock divided by 2  */
    kCLOCK_SLOW_CLK,   /*!< SYSTEM clock divided by 6  */
    kCLOCK_ExtClk,     /*!< External Clock             */
    kCLOCK_Fro16K,     /*!< FRO16K                     */
    kCLOCK_Fro12M,     /*!< FRO12M                     */
    kCLOCK_Fro12MDiv,  /*!< FRO12MDiv                  */
    kCLOCK_FroHf,      /*!< FROHF                      */
    kCLOCK_FroHfDiv,   /*!< Divided by FROHF           */
    kCLOCK_Clk48M,     /*!< CLK48M                     */
    kCLOCK_Pll1Clk,    /*!< Pll1Clk                    */
    kCLOCK_Pll1ClkDiv, /*!< Pll1CkDiv                  */
    kCLOCK_Clk1M,      /*!< CLK1M                      */
    kCLOCK_UsbPll,     /*!< UsbPll                     */
    kCLOCK_UsbPfdClk,  /*!< UsbPfdClk                  */
    kCLOCK_Clk16K0,    /*!< CLK16K[0]                  */
    kCLOCK_Clk16K1,    /*!< CLK16K[1]                  */
    kCLOCK_Clk16K2,    /*!< CLK16K[2]                  */
    kCLOCK_Osc32K0,    /*!< OSC32K[0]                  */
    kCLOCK_Osc32K1,    /*!< OSC32K[1]                  */
    kCLOCK_Osc32K2,    /*!< OSC32K[2]                  */
    kCLOCK_LpOsc,      /*!< Low Power Oscillator        */
} clock_name_t;

/*! @brief Peripherals clock source definition. */
#define BUS_CLK kCLOCK_BusClk

/*! @brief Clock Mux Switches
 *  The encoding is as follows each connection identified is 32bits wide while
 * 24bits are valuable starting from LSB upwards
 *
 *  [4 bits for choice, 0 means invalid choice] [8 bits mux ID]*
 *
 */
#define CLK_ATTACH_REG_OFFSET(value) (((uint32_t)(value)) >> 16U)
#define CLK_ATTACH_CLK_SEL(value)    (((uint32_t)(value)) & 0x0000FFFFU)
#define CLK_ATTACH_MUX(reg, sel)     ((((uint32_t)(reg)) << 16U) | (sel))

/*! @brief Clock name used to get clock frequency. */
typedef enum _clock_select_name
{
    kCLOCK_SelI3C0_FCLK     = (0x100U), /*!< I3C0_FCLK     clock selection */
    kCLOCK_SelI3C1_FCLK     = (0x108U), /*!< I3C1_FCLK     clock selection */
    kCLOCK_SelCTIMER0       = (0x110U), /*!< CTIMER0       clock selection */
    kCLOCK_SelCTIMER1       = (0x118U), /*!< CTIMER1       clock selection */
    kCLOCK_SelCTIMER2       = (0x120U), /*!< CTIMER2       clock selection */
    kCLOCK_SelCTIMER3       = (0x128U), /*!< CTIMER3       clock selection */
    kCLOCK_SelCTIMER4       = (0x130U), /*!< CTIMER4       clock selection */
    kCLOCK_SelWWDT1         = (0x140U), /*!< WWDT1         clock selection */
    kCLOCK_SelE1588         = (0x148U), /*!< E1588         clock selection */
    kCLOCK_SelRMII          = (0x150U), /*!< RMII          clock selection */
    kCLOCK_SelESPI0         = (0x158U), /*!< ESPI0         clock selection */
    kCLOCK_SelFLEXSPI0      = (0x160U), /*!< FLEXSPI0      clock selection */
    kCLOCK_SelLPSPI2        = (0x168U), /*!< LPSPI2        clock selection */
    kCLOCK_SelLPSPI3        = (0x170U), /*!< LPSPI3        clock selection */
    kCLOCK_SelLPSPI4        = (0x178U), /*!< LPSPI4        clock selection */
    kCLOCK_SelLPSPI5        = (0x180U), /*!< LPSPI5        clock selection */
    kCLOCK_SelTENBASET_PHY0 = (0x188U), /*!< TENBASET_PHY0 clock selection */
    kCLOCK_SelUSBHS         = (0x190U), /*!< USBHS          clock selection */
    kCLOCK_SelUSBHS_PHY     = (0x198U), /*!< USBHS_PHY      clock selection */
    kCLOCK_SelFLEXIO0       = (0x1A0U), /*!< FLEXIO0       clock selection */
    kCLOCK_SelLPI2C0        = (0x1A8U), /*!< LPI2C0        clock selection */
    kCLOCK_SelLPI2C1        = (0x1B0U), /*!< LPI2C1        clock selection */
    kCLOCK_SelLPSPI0        = (0x1B8U), /*!< LPSPI0        clock selection */
    kCLOCK_SelLPSPI1        = (0x1C0U), /*!< LPSPI1        clock selection */
    kCLOCK_SelI3C2_FCLK     = (0x1C8U), /*!< I3C2_FCLK     clock selection */
    kCLOCK_SelLPUART0       = (0x1D0U), /*!< LPUART0       clock selection */
    kCLOCK_SelLPUART1       = (0x1D8U), /*!< LPUART1       clock selection */
    kCLOCK_SelLPUART2       = (0x1E0U), /*!< LPUART2       clock selection */
    kCLOCK_SelLPUART3       = (0x1E8U), /*!< LPUART3       clock selection */
    kCLOCK_SelLPUART4       = (0x1F0U), /*!< LPUART4       clock selection */
    kCLOCK_SelLPTMR0        = (0x1F8U), /*!< LPTMR0        clock selection */
    kCLOCK_SelOSTIMER0      = (0x200U), /*!< OSTIMER0      clock selection */
    kCLOCK_SelADC           = (0x208U), /*!< ADCx          clock selection */
    kCLOCK_SelCMP0_RR       = (0x218U), /*!< CMP0_RR       clock selection */
    kCLOCK_SelDAC0          = (0x220U), /*!< DAC0          clock selection */
    kCLOCK_SelDAC1          = (0x228U), /*!< DAC1          clock selection */
    kCLOCK_SelTSI0          = (0x230U), /*!< TSI0          clock selection */
    kCLOCK_SelFLEXCAN0      = (0x238U), /*!< FLEXCAN0      clock selection */
    kCLOCK_SelFLEXCAN1      = (0x240U), /*!< FLEXCAN1      clock selection */
    kCLOCK_SelLPI2C2        = (0x248U), /*!< LPI2C2        clock selection */
    kCLOCK_SelLPI2C3        = (0x250U), /*!< LPI2C3        clock selection */
    kCLOCK_SelLPI2C4        = (0x258U), /*!< LPI2C4        clock selection */
    kCLOCK_SelLPUART5       = (0x260U), /*!< LPUART5       clock selection */
    kCLOCK_SelI3C3_FCLK     = (0x268U), /*!< I3C3_FCLK     clock selection */
    kCLOCK_SelTRACE         = (0x270U), /*!< TRACE         clock selection */
    kCLOCK_SelCLKOUT        = (0x278U), /*!< CLKOUT        clock selection */
    kCLOCK_SelSYSTICK       = (0x280U), /*!< SYSTICK       clock selection */
    kCLOCK_SelSCGSCS        = (0x300U), /*!< SCG SCS       clock selection */
    kCLOCK_SelMax           = (0x300U), /*!< MAX           clock selection */
} clock_select_name_t;

/*!
 * @brief The enumerator of clock attach Id.
 */
typedef enum _clock_attach_id
{
    kCLK_IN_to_MAIN_CLK  = CLK_ATTACH_MUX(kCLOCK_SelSCGSCS, 1U),            /*!< Attach clk_in to MAIN_CLK.     */
    kFRO12M_to_MAIN_CLK  = CLK_ATTACH_MUX(kCLOCK_SelSCGSCS, 2U),            /*!< Attach FRO_12M to MAIN_CLK.    */
    kFRO_HF_to_MAIN_CLK  = CLK_ATTACH_MUX(kCLOCK_SelSCGSCS, 3U),            /*!< Attach FRO_HF to MAIN_CLK.     */
    kOSC_32K_to_MAIN_CLK = CLK_ATTACH_MUX(kCLOCK_SelSCGSCS, 4U),            /*!< Attach OSC_32K[1] to MAIN_CLK. */
    kPll1Clk_to_MAIN_CLK = CLK_ATTACH_MUX(kCLOCK_SelSCGSCS, 6U),            /*!< Attach Pll1Clk to MAIN_CLK.    */
    kUSB_PFD_to_MAIN_CLK = CLK_ATTACH_MUX(kCLOCK_SelSCGSCS, 7U),            /*!< Attach Pll1Clk to MAIN_CLK.    */
    kNONE_to_MAIN_CLK    = CLK_ATTACH_MUX(kCLOCK_SelSCGSCS, 0U),            /*!< Attach NONE to MAIN_CLK.       */

