zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/MCXA577/drivers/fsl_clock.h
    kFRO_LF_DIV_to_I3C0FCLK = CLK_ATTACH_MUX(kCLOCK_SelI3C0_FCLK, 0U),      /*!< Attach FRO_LF_DIV to I3C0FCLK. */
    kFRO_HF_DIV_to_I3C0FCLK = CLK_ATTACH_MUX(kCLOCK_SelI3C0_FCLK, 2U),      /*!< Attach FRO_HF_DIV to I3C0FCLK. */
    kCLK_IN_to_I3C0FCLK     = CLK_ATTACH_MUX(kCLOCK_SelI3C0_FCLK, 3U),      /*!< Attach CLK_IN to I3C0FCLK.     */
    kCLK_1M_to_I3C0FCLK     = CLK_ATTACH_MUX(kCLOCK_SelI3C0_FCLK, 5U),      /*!< Attach CLK_1M to I3C0FCLK.     */
    kPll1ClkDiv_to_I3C0FCLK = CLK_ATTACH_MUX(kCLOCK_SelI3C0_FCLK, 6U),      /*!< Attach Pll1ClkDiv to I3C0FCLK. */
    kNONE_to_I3C0FCLK       = CLK_ATTACH_MUX(kCLOCK_SelI3C0_FCLK, 7U),      /*!< Attach NONE to I3C0FCLK.       */

    kFRO_LF_DIV_to_I3C1FCLK = CLK_ATTACH_MUX(kCLOCK_SelI3C1_FCLK, 0U),      /*!< Attach FRO_LF_DIV to I3C1FCLK. */
    kFRO_HF_DIV_to_I3C1FCLK = CLK_ATTACH_MUX(kCLOCK_SelI3C1_FCLK, 2U),      /*!< Attach FRO_HF_DIV to I3C1FCLK. */
    kCLK_IN_to_I3C1FCLK     = CLK_ATTACH_MUX(kCLOCK_SelI3C1_FCLK, 3U),      /*!< Attach CLK_IN to I3C1FCLK.     */
    kCLK_1M_to_I3C1FCLK     = CLK_ATTACH_MUX(kCLOCK_SelI3C1_FCLK, 5U),      /*!< Attach CLK_1M to I3C1FCLK.     */
    kPll1ClkDiv_to_I3C1FCLK = CLK_ATTACH_MUX(kCLOCK_SelI3C1_FCLK, 6U),      /*!< Attach Pll1ClkDiv to I3C1FCLK. */
    kNONE_to_I3C1FCLK       = CLK_ATTACH_MUX(kCLOCK_SelI3C1_FCLK, 7U),      /*!< Attach NONE to I3C1FCLK.       */

    kFRO_LF_DIV_to_I3C2FCLK = CLK_ATTACH_MUX(kCLOCK_SelI3C2_FCLK, 0U),      /*!< Attach FRO_LF_DIV to I3C2FCLK. */
    kFRO_HF_DIV_to_I3C2FCLK = CLK_ATTACH_MUX(kCLOCK_SelI3C2_FCLK, 2U),      /*!< Attach FRO_HF_DIV to I3C2FCLK. */
    kCLK_IN_to_I3C2FCLK     = CLK_ATTACH_MUX(kCLOCK_SelI3C2_FCLK, 3U),      /*!< Attach CLK_IN to I3C2FCLK.     */
    kCLK_1M_to_I3C2FCLK     = CLK_ATTACH_MUX(kCLOCK_SelI3C2_FCLK, 5U),      /*!< Attach CLK_1M to I3C2FCLK.     */
    kPll1ClkDiv_to_I3C2FCLK = CLK_ATTACH_MUX(kCLOCK_SelI3C2_FCLK, 6U),      /*!< Attach Pll1ClkDiv to I3C2FCLK. */
    kNONE_to_I3C2FCLK       = CLK_ATTACH_MUX(kCLOCK_SelI3C2_FCLK, 7U),      /*!< Attach NONE to I3C2FCLK.       */

    kFRO_LF_DIV_to_I3C3FCLK = CLK_ATTACH_MUX(kCLOCK_SelI3C3_FCLK, 0U),      /*!< Attach FRO_LF_DIV to I3C3FCLK. */
    kFRO_HF_DIV_to_I3C3FCLK = CLK_ATTACH_MUX(kCLOCK_SelI3C3_FCLK, 2U),      /*!< Attach FRO_HF_DIV to I3C3FCLK. */
    kCLK_IN_to_I3C3FCLK     = CLK_ATTACH_MUX(kCLOCK_SelI3C3_FCLK, 3U),      /*!< Attach CLK_IN to I3C3FCLK.     */
    kCLK_1M_to_I3C3FCLK     = CLK_ATTACH_MUX(kCLOCK_SelI3C3_FCLK, 5U),      /*!< Attach CLK_1M to I3C3FCLK.     */
    kPll1ClkDiv_to_I3C3FCLK = CLK_ATTACH_MUX(kCLOCK_SelI3C3_FCLK, 6U),      /*!< Attach Pll1ClkDiv to I3C3FCLK. */
    kNONE_to_I3C3FCLK       = CLK_ATTACH_MUX(kCLOCK_SelI3C3_FCLK, 7U),      /*!< Attach NONE to I3C3FCLK.       */

    kFRO_LF_DIV_to_CTIMER0 = CLK_ATTACH_MUX(kCLOCK_SelCTIMER0, 0U),         /*!< Attach FRO_LF_DIV to CTIMER0. */
    kFRO_HF_to_CTIMER0     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER0, 1U),         /*!< Attach FRO_HF to CTIMER0.     */
    kCLK_IN_to_CTIMER0     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER0, 3U),         /*!< Attach CLK_IN to CTIMER0.     */
    kLP_OSC_to_CTIMER0     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER0, 4U),         /*!< Attach LP_OSC to CTIMER0.     */
    kCLK_1M_to_CTIMER0     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER0, 5U),         /*!< Attach CLK_1M to CTIMER0.     */
    kPll1ClkDiv_to_CTIMER0 = CLK_ATTACH_MUX(kCLOCK_SelCTIMER0, 6U),         /*!< Attach Pll1ClkDiv to CTIMER0. */
    kNONE_to_CTIMER0       = CLK_ATTACH_MUX(kCLOCK_SelCTIMER0, 7U),         /*!< Attach NONE to CTIMER0.       */

    kFRO_LF_DIV_to_CTIMER1 = CLK_ATTACH_MUX(kCLOCK_SelCTIMER1, 0U),         /*!< Attach FRO_LF_DIV to CTIMER1. */
    kFRO_HF_to_CTIMER1     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER1, 1U),         /*!< Attach FRO_HF to CTIMER1.     */
    kCLK_IN_to_CTIMER1     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER1, 3U),         /*!< Attach CLK_IN to CTIMER1.     */
    kLP_OSC_to_CTIMER1     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER1, 4U),         /*!< Attach LP_OSC to CTIMER1.     */
    kCLK_1M_to_CTIMER1     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER1, 5U),         /*!< Attach CLK_1M to CTIMER1.     */
    kPll1ClkDiv_to_CTIMER1 = CLK_ATTACH_MUX(kCLOCK_SelCTIMER1, 6U),         /*!< Attach Pll1ClkDiv to CTIMER1. */
    kNONE_to_CTIMER1       = CLK_ATTACH_MUX(kCLOCK_SelCTIMER1, 7U),         /*!< Attach NONE to CTIMER1.       */

    kFRO_LF_DIV_to_CTIMER2 = CLK_ATTACH_MUX(kCLOCK_SelCTIMER2, 0U),         /*!< Attach FRO_LF_DIV to CTIMER2. */
    kFRO_HF_to_CTIMER2     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER2, 1U),         /*!< Attach FRO_HF to CTIMER2.     */
    kCLK_IN_to_CTIMER2     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER2, 3U),         /*!< Attach CLK_IN to CTIMER2.     */
    kLP_OSC_to_CTIMER2     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER2, 4U),         /*!< Attach LP_OSC to CTIMER2.     */
    kCLK_1M_to_CTIMER2     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER2, 5U),         /*!< Attach CLK_1M to CTIMER2.     */
    kPll1ClkDiv_to_CTIMER2 = CLK_ATTACH_MUX(kCLOCK_SelCTIMER2, 6U),         /*!< Attach Pll1ClkDiv to CTIMER2. */
    kNONE_to_CTIMER2       = CLK_ATTACH_MUX(kCLOCK_SelCTIMER2, 7U),         /*!< Attach NONE to CTIMER2.       */

    kFRO_LF_DIV_to_CTIMER3 = CLK_ATTACH_MUX(kCLOCK_SelCTIMER3, 0U),         /*!< Attach FRO_LF_DIV to CTIMER3. */
    kFRO_HF_to_CTIMER3     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER3, 1U),         /*!< Attach FRO_HF to CTIMER3.     */
    kCLK_IN_to_CTIMER3     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER3, 3U),         /*!< Attach CLK_IN to CTIMER3.     */
    kLP_OSC_to_CTIMER3     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER3, 4U),         /*!< Attach LP_OSC to CTIMER3.     */
    kCLK_1M_to_CTIMER3     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER3, 5U),         /*!< Attach CLK_1M to CTIMER3.     */
    kPll1ClkDiv_to_CTIMER3 = CLK_ATTACH_MUX(kCLOCK_SelCTIMER3, 6U),         /*!< Attach Pll1ClkDiv to CTIMER3. */
    kNONE_to_CTIMER3       = CLK_ATTACH_MUX(kCLOCK_SelCTIMER3, 7U),         /*!< Attach NONE to CTIMER3.       */

    kFRO_LF_DIV_to_CTIMER4 = CLK_ATTACH_MUX(kCLOCK_SelCTIMER4, 0U),         /*!< Attach FRO_LF_DIV to CTIMER4. */
    kFRO_HF_to_CTIMER4     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER4, 1U),         /*!< Attach FRO_HF to CTIMER4.     */
    kCLK_IN_to_CTIMER4     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER4, 3U),         /*!< Attach CLK_IN to CTIMER4.     */
    kLP_OSC_to_CTIMER4     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER4, 4U),         /*!< Attach LP_OSC to CTIMER4.     */
    kCLK_1M_to_CTIMER4     = CLK_ATTACH_MUX(kCLOCK_SelCTIMER4, 5U),         /*!< Attach CLK_1M to CTIMER4.     */
    kPll1ClkDiv_to_CTIMER4 = CLK_ATTACH_MUX(kCLOCK_SelCTIMER4, 6U),         /*!< Attach Pll1ClkDiv to CTIMER4. */
    kNONE_to_CTIMER4       = CLK_ATTACH_MUX(kCLOCK_SelCTIMER4, 7U),         /*!< Attach NONE to CTIMER4.       */

    kFRO_LF_DIV_to_FLEXIO0 = CLK_ATTACH_MUX(kCLOCK_SelFLEXIO0, 0U),         /*!< Attach FRO_LF_DIV to FLEXIO0. */
    kFRO_HF_to_FLEXIO0     = CLK_ATTACH_MUX(kCLOCK_SelFLEXIO0, 1U),         /*!< Attach FRO_HF to FLEXIO0.     */
    kCLK_IN_to_FLEXIO0     = CLK_ATTACH_MUX(kCLOCK_SelFLEXIO0, 3U),         /*!< Attach CLK_IN to FLEXIO0.     */
    kCLK_1M_to_FLEXIO0     = CLK_ATTACH_MUX(kCLOCK_SelFLEXIO0, 5U),         /*!< Attach CLK_1M to FLEXIO0.     */
    kPll1ClkDiv_to_FLEXIO0 = CLK_ATTACH_MUX(kCLOCK_SelFLEXIO0, 6U),         /*!< Attach Pll1ClkDiv to FLEXIO0. */
    kNONE_to_FLEXIO0       = CLK_ATTACH_MUX(kCLOCK_SelFLEXIO0, 7U),         /*!< Attach NONE to FLEXIO0.       */

