zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/MCXA577/drivers/fsl_clock.h
    kFRO_HF_to_FLEXCAN0     = CLK_ATTACH_MUX(kCLOCK_SelFLEXCAN0, 1U),       /*!< Attach FRO_HF to FLEXCAN0.     */
    kFRO_HF_DIV_to_FLEXCAN0 = CLK_ATTACH_MUX(kCLOCK_SelFLEXCAN0, 2U),       /*!< Attach FRO_HF_DIV to FLEXCAN0. */
    kCLK_IN_to_FLEXCAN0     = CLK_ATTACH_MUX(kCLOCK_SelFLEXCAN0, 3U),       /*!< Attach CLK_IN to FLEXCAN0.     */
    kUSB_PLL_to_FLEXCAN0    = CLK_ATTACH_MUX(kCLOCK_SelFLEXCAN0, 4U),       /*!< Attach USB_PLL to FLEXCAN0.    */
    kPll1ClkDiv_to_FLEXCAN0 = CLK_ATTACH_MUX(kCLOCK_SelFLEXCAN0, 6U),       /*!< Attach Pll1ClkDiv to FLEXCAN0. */
    kNONE_to_FLEXCAN0       = CLK_ATTACH_MUX(kCLOCK_SelFLEXCAN0, 7U),       /*!< Attach NONE to FLEXCAN0.       */

    kFRO_HF_to_FLEXCAN1     = CLK_ATTACH_MUX(kCLOCK_SelFLEXCAN1, 1U),       /*!< Attach FRO_HF to FLEXCAN1.     */
    kFRO_HF_DIV_to_FLEXCAN1 = CLK_ATTACH_MUX(kCLOCK_SelFLEXCAN1, 2U),       /*!< Attach FRO_HF_DIV to FLEXCAN1. */
    kCLK_IN_to_FLEXCAN1     = CLK_ATTACH_MUX(kCLOCK_SelFLEXCAN1, 3U),       /*!< Attach CLK_IN to FLEXCAN1.     */
    kUSB_PLL_to_FLEXCAN1    = CLK_ATTACH_MUX(kCLOCK_SelFLEXCAN1, 4U),       /*!< Attach USB_PLL to FLEXCAN1.    */
    kPll1ClkDiv_to_FLEXCAN1 = CLK_ATTACH_MUX(kCLOCK_SelFLEXCAN1, 6U),       /*!< Attach Pll1ClkDiv to FLEXCAN1. */
    kNONE_to_FLEXCAN1       = CLK_ATTACH_MUX(kCLOCK_SelFLEXCAN1, 7U),       /*!< Attach NONE to FLEXCAN1.       */

    kFRO_LF_DIV_to_DAC0 = CLK_ATTACH_MUX(kCLOCK_SelDAC0, 0U),               /*!< Attach FRO_LF_DIV to DAC0.  */
    kFRO_HF_DIV_to_DAC0 = CLK_ATTACH_MUX(kCLOCK_SelDAC0, 2U),               /*!< Attach FRO_HF_DIV to DAC0.  */
    kCLK_IN_to_DAC0     = CLK_ATTACH_MUX(kCLOCK_SelDAC0, 3U),               /*!< Attach CLK_IN to DAC0.      */
    kCLK_1M_to_DAC0     = CLK_ATTACH_MUX(kCLOCK_SelDAC0, 5U),               /*!< Attach CLK_1M to DAC0.      */
    kPll1ClkDiv_to_DAC0 = CLK_ATTACH_MUX(kCLOCK_SelDAC0, 6U),               /*!< Attach Pll1ClkDiv to DAC0.  */
    kNONE_to_DAC0       = CLK_ATTACH_MUX(kCLOCK_SelDAC0, 7U),               /*!< Attach NONE to DAC0.        */

    kFRO_LF_DIV_to_DAC1 = CLK_ATTACH_MUX(kCLOCK_SelDAC1, 0U),               /*!< Attach FRO_LF_DIV to DAC1.  */
    kFRO_HF_DIV_to_DAC1 = CLK_ATTACH_MUX(kCLOCK_SelDAC1, 2U),               /*!< Attach FRO_HF_DIV to DAC1.  */
    kCLK_IN_to_DAC1     = CLK_ATTACH_MUX(kCLOCK_SelDAC1, 3U),               /*!< Attach CLK_IN to DAC1.      */
    kCLK_1M_to_DAC1     = CLK_ATTACH_MUX(kCLOCK_SelDAC1, 5U),               /*!< Attach CLK_1M to DAC1.      */
    kPll1ClkDiv_to_DAC1 = CLK_ATTACH_MUX(kCLOCK_SelDAC1, 6U),               /*!< Attach Pll1ClkDiv to DAC1.  */
    kNONE_to_DAC1       = CLK_ATTACH_MUX(kCLOCK_SelDAC1, 7U),               /*!< Attach NONE to DAC1.        */

    kFRO_LF_DIV_to_LPI2C0 = CLK_ATTACH_MUX(kCLOCK_SelLPI2C0, 0U),           /*!< Attach FRO_LF_DIV to LPI2C0. */
    kFRO_HF_DIV_to_LPI2C0 = CLK_ATTACH_MUX(kCLOCK_SelLPI2C0, 2U),           /*!< Attach FRO_HF_DIV to LPI2C0. */
    kCLK_IN_to_LPI2C0     = CLK_ATTACH_MUX(kCLOCK_SelLPI2C0, 3U),           /*!< Attach CLK_IN to LPI2C0.     */
    kCLK_1M_to_LPI2C0     = CLK_ATTACH_MUX(kCLOCK_SelLPI2C0, 5U),           /*!< Attach CLK_1M to LPI2C0.     */
    kPll1ClkDiv_to_LPI2C0 = CLK_ATTACH_MUX(kCLOCK_SelLPI2C0, 6U),           /*!< Attach Pll1ClkDiv to LPI2C0. */
    kNONE_to_LPI2C0       = CLK_ATTACH_MUX(kCLOCK_SelLPI2C0, 7U),           /*!< Attach NONE to LPI2C0.       */

    kFRO_LF_DIV_to_LPI2C1 = CLK_ATTACH_MUX(kCLOCK_SelLPI2C1, 0U),           /*!< Attach FRO_LF_DIV to LPI2C1. */
    kFRO_HF_DIV_to_LPI2C1 = CLK_ATTACH_MUX(kCLOCK_SelLPI2C1, 2U),           /*!< Attach FRO_HF_DIV to LPI2C1. */
    kCLK_IN_to_LPI2C1     = CLK_ATTACH_MUX(kCLOCK_SelLPI2C1, 3U),           /*!< Attach CLK_IN to LPI2C1.     */
    kCLK_1M_to_LPI2C1     = CLK_ATTACH_MUX(kCLOCK_SelLPI2C1, 5U),           /*!< Attach CLK_1M to LPI2C1.     */
    kPll1ClkDiv_to_LPI2C1 = CLK_ATTACH_MUX(kCLOCK_SelLPI2C1, 6U),           /*!< Attach Pll1ClkDiv to LPI2C1. */
    kNONE_to_LPI2C1       = CLK_ATTACH_MUX(kCLOCK_SelLPI2C1, 7U),           /*!< Attach NONE to LPI2C1.       */

    kFRO_LF_DIV_to_LPI2C2 = CLK_ATTACH_MUX(kCLOCK_SelLPI2C2, 0U),           /*!< Attach FRO_LF_DIV to LPI2C2. */
    kFRO_HF_DIV_to_LPI2C2 = CLK_ATTACH_MUX(kCLOCK_SelLPI2C2, 2U),           /*!< Attach FRO_HF_DIV to LPI2C2. */
    kCLK_IN_to_LPI2C2     = CLK_ATTACH_MUX(kCLOCK_SelLPI2C2, 3U),           /*!< Attach CLK_IN to LPI2C2.     */
    kCLK_1M_to_LPI2C2     = CLK_ATTACH_MUX(kCLOCK_SelLPI2C2, 5U),           /*!< Attach CLK_1M to LPI2C2.     */
    kPll1ClkDiv_to_LPI2C2 = CLK_ATTACH_MUX(kCLOCK_SelLPI2C2, 6U),           /*!< Attach Pll1ClkDiv to LPI2C2. */
    kNONE_to_LPI2C2       = CLK_ATTACH_MUX(kCLOCK_SelLPI2C2, 7U),           /*!< Attach NONE to LPI2C2.       */

    kFRO_LF_DIV_to_LPI2C3 = CLK_ATTACH_MUX(kCLOCK_SelLPI2C3, 0U),           /*!< Attach FRO_LF_DIV to LPI2C3. */
    kFRO_HF_DIV_to_LPI2C3 = CLK_ATTACH_MUX(kCLOCK_SelLPI2C3, 2U),           /*!< Attach FRO_HF_DIV to LPI2C3. */
    kCLK_IN_to_LPI2C3     = CLK_ATTACH_MUX(kCLOCK_SelLPI2C3, 3U),           /*!< Attach CLK_IN to LPI2C3.     */
    kCLK_1M_to_LPI2C3     = CLK_ATTACH_MUX(kCLOCK_SelLPI2C3, 5U),           /*!< Attach CLK_1M to LPI2C3.     */
    kPll1ClkDiv_to_LPI2C3 = CLK_ATTACH_MUX(kCLOCK_SelLPI2C3, 6U),           /*!< Attach Pll1ClkDiv to LPI2C3. */
    kNONE_to_LPI2C3       = CLK_ATTACH_MUX(kCLOCK_SelLPI2C3, 7U),           /*!< Attach NONE to LPI2C3.       */

    kFRO_LF_DIV_to_LPI2C4 = CLK_ATTACH_MUX(kCLOCK_SelLPI2C4, 0U),           /*!< Attach FRO_LF_DIV to LPI2C4. */
    kFRO_HF_DIV_to_LPI2C4 = CLK_ATTACH_MUX(kCLOCK_SelLPI2C4, 2U),           /*!< Attach FRO_HF_DIV to LPI2C4. */
    kCLK_IN_to_LPI2C4     = CLK_ATTACH_MUX(kCLOCK_SelLPI2C4, 3U),           /*!< Attach CLK_IN to LPI2C4.     */
    kCLK_1M_to_LPI2C4     = CLK_ATTACH_MUX(kCLOCK_SelLPI2C4, 5U),           /*!< Attach CLK_1M to LPI2C4.     */
    kPll1ClkDiv_to_LPI2C4 = CLK_ATTACH_MUX(kCLOCK_SelLPI2C4, 6U),           /*!< Attach Pll1ClkDiv to LPI2C4. */
    kNONE_to_LPI2C4       = CLK_ATTACH_MUX(kCLOCK_SelLPI2C4, 7U),           /*!< Attach NONE to LPI2C4.       */

    kFRO_LF_DIV_to_LPSPI0 = CLK_ATTACH_MUX(kCLOCK_SelLPSPI0, 0U),           /*!< Attach FRO_LF_DIV to LPSPI0. */
    kFRO_HF_DIV_to_LPSPI0 = CLK_ATTACH_MUX(kCLOCK_SelLPSPI0, 2U),           /*!< Attach FRO_HF_DIV to LPSPI0. */
    kCLK_IN_to_LPSPI0     = CLK_ATTACH_MUX(kCLOCK_SelLPSPI0, 3U),           /*!< Attach CLK_IN to LPSPI0.     */
    kCLK_1M_to_LPSPI0     = CLK_ATTACH_MUX(kCLOCK_SelLPSPI0, 5U),           /*!< Attach CLK_1M to LPSPI0.     */
    kPll1ClkDiv_to_LPSPI0 = CLK_ATTACH_MUX(kCLOCK_SelLPSPI0, 6U),           /*!< Attach Pll1ClkDiv to LPSPI0. */
    kNONE_to_LPSPI0       = CLK_ATTACH_MUX(kCLOCK_SelLPSPI0, 7U),           /*!< Attach NONE to LPSPI0.       */

    kFRO_LF_DIV_to_LPSPI1 = CLK_ATTACH_MUX(kCLOCK_SelLPSPI1, 0U),           /*!< Attach FRO_LF_DIV to LPSPI1. */
    kFRO_HF_DIV_to_LPSPI1 = CLK_ATTACH_MUX(kCLOCK_SelLPSPI1, 2U),           /*!< Attach FRO_HF_DIV to LPSPI1. */
    kCLK_IN_to_LPSPI1     = CLK_ATTACH_MUX(kCLOCK_SelLPSPI1, 3U),           /*!< Attach CLK_IN to LPSPI1.     */
    kCLK_1M_to_LPSPI1     = CLK_ATTACH_MUX(kCLOCK_SelLPSPI1, 5U),           /*!< Attach CLK_1M to LPSPI1.     */
    kPll1ClkDiv_to_LPSPI1 = CLK_ATTACH_MUX(kCLOCK_SelLPSPI1, 6U),           /*!< Attach Pll1ClkDiv to LPSPI1. */
    kNONE_to_LPSPI1       = CLK_ATTACH_MUX(kCLOCK_SelLPSPI1, 7U),           /*!< Attach NONE to LPSPI1.       */

    kFRO_LF_DIV_to_LPSPI2 = CLK_ATTACH_MUX(kCLOCK_SelLPSPI2, 0U),           /*!< Attach FRO_LF_DIV to LPSPI2. */
    kFRO_HF_DIV_to_LPSPI2 = CLK_ATTACH_MUX(kCLOCK_SelLPSPI2, 2U),           /*!< Attach FRO_HF_DIV to LPSPI2. */
    kCLK_IN_to_LPSPI2     = CLK_ATTACH_MUX(kCLOCK_SelLPSPI2, 3U),           /*!< Attach CLK_IN to LPSPI2.     */
    kCLK_1M_to_LPSPI2     = CLK_ATTACH_MUX(kCLOCK_SelLPSPI2, 5U),           /*!< Attach CLK_1M to LPSPI2.     */
    kPll1ClkDiv_to_LPSPI2 = CLK_ATTACH_MUX(kCLOCK_SelLPSPI2, 6U),           /*!< Attach Pll1ClkDiv to LPSPI2. */
    kNONE_to_LPSPI2       = CLK_ATTACH_MUX(kCLOCK_SelLPSPI2, 7U),           /*!< Attach NONE to LPSPI2.       */

