zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/MCXA577/drivers/fsl_clock.h
    kFRO_LF_DIV_to_LPSPI3 = CLK_ATTACH_MUX(kCLOCK_SelLPSPI3, 0U),           /*!< Attach FRO_LF_DIV to LPSPI3. */
    kFRO_HF_DIV_to_LPSPI3 = CLK_ATTACH_MUX(kCLOCK_SelLPSPI3, 2U),           /*!< Attach FRO_HF_DIV to LPSPI3. */
    kCLK_IN_to_LPSPI3     = CLK_ATTACH_MUX(kCLOCK_SelLPSPI3, 3U),           /*!< Attach CLK_IN to LPSPI3.     */
    kCLK_1M_to_LPSPI3     = CLK_ATTACH_MUX(kCLOCK_SelLPSPI3, 5U),           /*!< Attach CLK_1M to LPSPI3.     */
    kPll1ClkDiv_to_LPSPI3 = CLK_ATTACH_MUX(kCLOCK_SelLPSPI3, 6U),           /*!< Attach Pll1ClkDiv to LPSPI3. */
    kNONE_to_LPSPI3       = CLK_ATTACH_MUX(kCLOCK_SelLPSPI3, 7U),           /*!< Attach NONE to LPSPI3.       */

    kFRO_LF_DIV_to_LPSPI4 = CLK_ATTACH_MUX(kCLOCK_SelLPSPI4, 0U),           /*!< Attach FRO_LF_DIV to LPSPI4. */
    kFRO_HF_DIV_to_LPSPI4 = CLK_ATTACH_MUX(kCLOCK_SelLPSPI4, 2U),           /*!< Attach FRO_HF_DIV to LPSPI4. */
    kCLK_IN_to_LPSPI4     = CLK_ATTACH_MUX(kCLOCK_SelLPSPI4, 3U),           /*!< Attach CLK_IN to LPSPI4.     */
    kCLK_1M_to_LPSPI4     = CLK_ATTACH_MUX(kCLOCK_SelLPSPI4, 5U),           /*!< Attach CLK_1M to LPSPI4.     */
    kPll1ClkDiv_to_LPSPI4 = CLK_ATTACH_MUX(kCLOCK_SelLPSPI4, 6U),           /*!< Attach Pll1ClkDiv to LPSPI4. */
    kNONE_to_LPSPI4       = CLK_ATTACH_MUX(kCLOCK_SelLPSPI4, 7U),           /*!< Attach NONE to LPSPI4.       */

    kFRO_LF_DIV_to_LPSPI5 = CLK_ATTACH_MUX(kCLOCK_SelLPSPI5, 0U),           /*!< Attach FRO_LF_DIV to LPSPI5. */
    kFRO_HF_DIV_to_LPSPI5 = CLK_ATTACH_MUX(kCLOCK_SelLPSPI5, 2U),           /*!< Attach FRO_HF_DIV to LPSPI5. */
    kCLK_IN_to_LPSPI5     = CLK_ATTACH_MUX(kCLOCK_SelLPSPI5, 3U),           /*!< Attach CLK_IN to LPSPI5.     */
    kCLK_1M_to_LPSPI5     = CLK_ATTACH_MUX(kCLOCK_SelLPSPI5, 5U),           /*!< Attach CLK_1M to LPSPI5.     */
    kPll1ClkDiv_to_LPSPI5 = CLK_ATTACH_MUX(kCLOCK_SelLPSPI5, 6U),           /*!< Attach Pll1ClkDiv to LPSPI5. */
    kNONE_to_LPSPI5       = CLK_ATTACH_MUX(kCLOCK_SelLPSPI5, 7U),           /*!< Attach NONE to LPSPI5.       */

    kFRO_LF_DIV_to_LPUART0 = CLK_ATTACH_MUX(kCLOCK_SelLPUART0, 0U),         /*!< Attach FRO_LF_DIV to LPUART0. */
    kFRO_HF_DIV_to_LPUART0 = CLK_ATTACH_MUX(kCLOCK_SelLPUART0, 2U),         /*!< Attach FRO_HF_DIV to LPUART0. */
    kCLK_IN_to_LPUART0     = CLK_ATTACH_MUX(kCLOCK_SelLPUART0, 3U),         /*!< Attach CLK_IN to LPUART0.     */
    kLP_OSC_to_LPUART0     = CLK_ATTACH_MUX(kCLOCK_SelLPUART0, 4U),         /*!< Attach LP_OSC to LPUART0.     */
    kCLK_1M_to_LPUART0     = CLK_ATTACH_MUX(kCLOCK_SelLPUART0, 5U),         /*!< Attach CLK_1M to LPUART0.     */
    kPll1ClkDiv_to_LPUART0 = CLK_ATTACH_MUX(kCLOCK_SelLPUART0, 6U),         /*!< Attach Pll1ClkDiv to LPUART0. */
    kNONE_to_LPUART0       = CLK_ATTACH_MUX(kCLOCK_SelLPUART0, 7U),         /*!< Attach NONE to LPUART0.       */

    kFRO_LF_DIV_to_LPUART1 = CLK_ATTACH_MUX(kCLOCK_SelLPUART1, 0U),         /*!< Attach FRO_LF_DIV to LPUART1. */
    kFRO_HF_DIV_to_LPUART1 = CLK_ATTACH_MUX(kCLOCK_SelLPUART1, 2U),         /*!< Attach FRO_HF_DIV to LPUART1. */
    kCLK_IN_to_LPUART1     = CLK_ATTACH_MUX(kCLOCK_SelLPUART1, 3U),         /*!< Attach CLK_IN to LPUART1.     */
    kLP_OSC_to_LPUART1     = CLK_ATTACH_MUX(kCLOCK_SelLPUART1, 4U),         /*!< Attach LP_OSC to LPUART1.     */
    kCLK_1M_to_LPUART1     = CLK_ATTACH_MUX(kCLOCK_SelLPUART1, 5U),         /*!< Attach CLK_1M to LPUART1.     */
    kPll1ClkDiv_to_LPUART1 = CLK_ATTACH_MUX(kCLOCK_SelLPUART1, 6U),         /*!< Attach Pll1ClkDiv to LPUART1. */
    kNONE_to_LPUART1       = CLK_ATTACH_MUX(kCLOCK_SelLPUART1, 7U),         /*!< Attach NONE to LPUART1.       */

    kFRO_LF_DIV_to_LPUART2 = CLK_ATTACH_MUX(kCLOCK_SelLPUART2, 0U),         /*!< Attach FRO_LF_DIV to LPUART2. */
    kFRO_HF_DIV_to_LPUART2 = CLK_ATTACH_MUX(kCLOCK_SelLPUART2, 2U),         /*!< Attach FRO_HF_DIV to LPUART2. */
    kCLK_IN_to_LPUART2     = CLK_ATTACH_MUX(kCLOCK_SelLPUART2, 3U),         /*!< Attach CLK_IN to LPUART2.     */
    kLP_OSC_to_LPUART2     = CLK_ATTACH_MUX(kCLOCK_SelLPUART2, 4U),         /*!< Attach LP_OSC to LPUART2.     */
    kCLK_1M_to_LPUART2     = CLK_ATTACH_MUX(kCLOCK_SelLPUART2, 5U),         /*!< Attach CLK_1M to LPUART2.     */
    kPll1ClkDiv_to_LPUART2 = CLK_ATTACH_MUX(kCLOCK_SelLPUART2, 6U),         /*!< Attach Pll1ClkDiv to LPUART2. */
    kNONE_to_LPUART2       = CLK_ATTACH_MUX(kCLOCK_SelLPUART2, 7U),         /*!< Attach NONE to LPUART2.       */

    kFRO_LF_DIV_to_LPUART3 = CLK_ATTACH_MUX(kCLOCK_SelLPUART3, 0U),         /*!< Attach FRO_LF_DIV to LPUART3. */
    kFRO_HF_DIV_to_LPUART3 = CLK_ATTACH_MUX(kCLOCK_SelLPUART3, 2U),         /*!< Attach FRO_HF_DIV to LPUART3. */
    kCLK_IN_to_LPUART3     = CLK_ATTACH_MUX(kCLOCK_SelLPUART3, 3U),         /*!< Attach CLK_IN to LPUART3.     */
    kLP_OSC_to_LPUART3     = CLK_ATTACH_MUX(kCLOCK_SelLPUART3, 4U),         /*!< Attach LP_OSC to LPUART3.     */
    kCLK_1M_to_LPUART3     = CLK_ATTACH_MUX(kCLOCK_SelLPUART3, 5U),         /*!< Attach CLK_1M to LPUART3.     */
    kPll1ClkDiv_to_LPUART3 = CLK_ATTACH_MUX(kCLOCK_SelLPUART3, 6U),         /*!< Attach Pll1ClkDiv to LPUART3. */
    kNONE_to_LPUART3       = CLK_ATTACH_MUX(kCLOCK_SelLPUART3, 7U),         /*!< Attach NONE to LPUART3.       */

    kFRO_LF_DIV_to_LPUART4 = CLK_ATTACH_MUX(kCLOCK_SelLPUART4, 0U),         /*!< Attach FRO_LF_DIV to LPUART4. */
    kFRO_HF_DIV_to_LPUART4 = CLK_ATTACH_MUX(kCLOCK_SelLPUART4, 2U),         /*!< Attach FRO_HF_DIV to LPUART4. */
    kCLK_IN_to_LPUART4     = CLK_ATTACH_MUX(kCLOCK_SelLPUART4, 3U),         /*!< Attach CLK_IN to LPUART4.     */
    kLP_OSC_to_LPUART4     = CLK_ATTACH_MUX(kCLOCK_SelLPUART4, 4U),         /*!< Attach LP_OSC to LPUART4.     */
    kCLK_1M_to_LPUART4     = CLK_ATTACH_MUX(kCLOCK_SelLPUART4, 5U),         /*!< Attach CLK_1M to LPUART4.     */
    kPll1ClkDiv_to_LPUART4 = CLK_ATTACH_MUX(kCLOCK_SelLPUART4, 6U),         /*!< Attach Pll1ClkDiv to LPUART4. */
    kNONE_to_LPUART4       = CLK_ATTACH_MUX(kCLOCK_SelLPUART4, 7U),         /*!< Attach NONE to LPUART4.       */

    kFRO_LF_DIV_to_LPUART5 = CLK_ATTACH_MUX(kCLOCK_SelLPUART5, 0U),         /*!< Attach FRO_LF_DIV to LPUART5. */
    kFRO_HF_DIV_to_LPUART5 = CLK_ATTACH_MUX(kCLOCK_SelLPUART5, 2U),         /*!< Attach FRO_HF_DIV to LPUART5. */
    kCLK_IN_to_LPUART5     = CLK_ATTACH_MUX(kCLOCK_SelLPUART5, 3U),         /*!< Attach CLK_IN to LPUART5.     */
    kLP_OSC_to_LPUART5     = CLK_ATTACH_MUX(kCLOCK_SelLPUART5, 4U),         /*!< Attach LP_OSC to LPUART5.     */
    kCLK_1M_to_LPUART5     = CLK_ATTACH_MUX(kCLOCK_SelLPUART5, 5U),         /*!< Attach CLK_1M to LPUART5.     */
    kPll1ClkDiv_to_LPUART5 = CLK_ATTACH_MUX(kCLOCK_SelLPUART5, 6U),         /*!< Attach Pll1ClkDiv to LPUART5. */
    kNONE_to_LPUART5       = CLK_ATTACH_MUX(kCLOCK_SelLPUART5, 7U),         /*!< Attach NONE to LPUART5.       */

    kCLK_32K_to_USBHS      = CLK_ATTACH_MUX(kCLOCK_SelUSBHS, 0U),           /*!< Attach CLK_32K to USBHS.*/
    kCLK_1M_to_USBHS       = CLK_ATTACH_MUX(kCLOCK_SelUSBHS, 1U),           /*!< Attach CLK_1M to USBHS.*/
    kPHY_CLK_XTAL_to_USBHS = CLK_ATTACH_MUX(kCLOCK_SelUSBHS, 2U),           /*!< Attach CLK_IN to USBHS.*/
    kNONE_to_USBHS         = CLK_ATTACH_MUX(kCLOCK_SelUSBHS, 3U),           /*!< Attach NONE to USBHS.  */

