zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/MCXA577/drivers/fsl_clock.h
    kFRO_HF_to_USBHS_PHY = CLK_ATTACH_MUX(kCLOCK_SelUSBHS_PHY, 1U),         /*!< Attach FRO_HF to USBHS_PHY.*/
    kCLK_IN_to_USBHS_PHY = CLK_ATTACH_MUX(kCLOCK_SelUSBHS_PHY, 2U),         /*!< Attach CLK_IN to USBHS_PHY.*/
    kNONE_to_USBHS_PHY   = CLK_ATTACH_MUX(kCLOCK_SelUSBHS_PHY, 3U),         /*!< Attach NONE to USBHS_PHY.  */

    kFRO_LF_DIV_to_LPTMR0 = CLK_ATTACH_MUX(kCLOCK_SelLPTMR0, 0U),           /*!< Attach FRO_LF_DIV to LPTMR0. */
    kFRO_HF_DIV_to_LPTMR0 = CLK_ATTACH_MUX(kCLOCK_SelLPTMR0, 2U),           /*!< Attach FRO_HF_DIV to LPTMR0. */
    kCLK_IN_to_LPTMR0     = CLK_ATTACH_MUX(kCLOCK_SelLPTMR0, 3U),           /*!< Attach CLK_IN to LPTMR0.     */
    kCLK_1M_to_LPTMR0     = CLK_ATTACH_MUX(kCLOCK_SelLPTMR0, 5U),           /*!< Attach CLK_1M to LPTMR0.     */
    kPll1ClkDiv_to_LPTMR0 = CLK_ATTACH_MUX(kCLOCK_SelLPTMR0, 6U),           /*!< Attach Pll1ClkDiv to LPTMR0. */
    kNONE_to_LPTMR0       = CLK_ATTACH_MUX(kCLOCK_SelLPTMR0, 7U),           /*!< Attach NONE to LPTMR0.       */

    kCLK_16K_to_OSTIMER = CLK_ATTACH_MUX(kCLOCK_SelOSTIMER0, 0U),           /*!< Attach FRO16K to OSTIMER0. */
    kCLK_1M_to_OSTIMER  = CLK_ATTACH_MUX(kCLOCK_SelOSTIMER0, 2U),           /*!< Attach CLK_1M to OSTIMER0. */
    kNONE_to_OSTIMER    = CLK_ATTACH_MUX(kCLOCK_SelOSTIMER0, 3U),           /*!< Attach NONE to OSTIMER0.   */

    kFRO_LF_DIV_to_ADC = CLK_ATTACH_MUX(kCLOCK_SelADC, 0U),                 /*!< Attach FRO_LF_DIV to ADC. */
    kFRO_HF_to_ADC     = CLK_ATTACH_MUX(kCLOCK_SelADC, 1U),                 /*!< Attach FRO_HF to ADC.     */
    kCLK_IN_to_ADC     = CLK_ATTACH_MUX(kCLOCK_SelADC, 3U),                 /*!< Attach CLK_IN to ADC.     */
    kUSB_PLL_to_ADC    = CLK_ATTACH_MUX(kCLOCK_SelADC, 4U),                 /*!< Attach USB_PL to ADC.     */
    kCLK_1M_to_ADC     = CLK_ATTACH_MUX(kCLOCK_SelADC, 5U),                 /*!< Attach CLK_1M to ADC.     */
    kPll1ClkDiv_to_ADC = CLK_ATTACH_MUX(kCLOCK_SelADC, 6U),                 /*!< Attach Pll1ClkDiv to ADC. */
    kNONE_to_ADC       = CLK_ATTACH_MUX(kCLOCK_SelADC, 7U),                 /*!< Attach NONE to ADC.       */

    kFRO_LF_DIV_to_CMP0 = CLK_ATTACH_MUX(kCLOCK_SelCMP0_RR, 0U),            /*!< Attach FRO_LF_DIV to CMP0. */
    kFRO_HF_DIV_to_CMP0 = CLK_ATTACH_MUX(kCLOCK_SelCMP0_RR, 2U),            /*!< Attach FRO_HF_DIV to CMP0. */
    kCLK_IN_to_CMP0     = CLK_ATTACH_MUX(kCLOCK_SelCMP0_RR, 3U),            /*!< Attach CLK_IN to CMP0.     */
    kCLK_1M_to_CMP0     = CLK_ATTACH_MUX(kCLOCK_SelCMP0_RR, 5U),            /*!< Attach CLK_1M to CMP0.     */
    kPll1ClkDiv_to_CMP0 = CLK_ATTACH_MUX(kCLOCK_SelCMP0_RR, 6U),            /*!< Attach Pll1ClkDiv to CMP0. */
    kNONE_to_CMP0       = CLK_ATTACH_MUX(kCLOCK_SelCMP0_RR, 7U),            /*!< Attach NONE to CMP0.       */

    kCPU_CLK_to_TRACE = CLK_ATTACH_MUX(kCLOCK_SelTRACE, 0U),                /*!< Attach CPU_CLK to TRACE. */
    kCLK_1M_to_TRACE  = CLK_ATTACH_MUX(kCLOCK_SelTRACE, 1U),                /*!< Attach CLK_1M to TRACE.  */
    kCLK_16K_to_TRACE = CLK_ATTACH_MUX(kCLOCK_SelTRACE, 2U),                /*!< Attach CLK_16K to TRACE. */
    kNONE_to_TRACE    = CLK_ATTACH_MUX(kCLOCK_SelTRACE, 3U),                /*!< Attach NONE to TRACE.    */

    kFRO12M_to_CLKOUT     = CLK_ATTACH_MUX(kCLOCK_SelCLKOUT, 0U),           /*!< Attach FRO_12M to CLKOUT.    */
    kFRO_HF_DIV_to_CLKOUT = CLK_ATTACH_MUX(kCLOCK_SelCLKOUT, 1U),           /*!< Attach FRO_HF_DIV to CLKOUT. */
    kCLK_IN_to_CLKOUT     = CLK_ATTACH_MUX(kCLOCK_SelCLKOUT, 2U),           /*!< Attach CLK_IN to CLKOUT.     */
    kLP_OSC_to_CLKOUT     = CLK_ATTACH_MUX(kCLOCK_SelCLKOUT, 3U),           /*!< Attach LP_OSC to CLKOUT.     */
    kPll1ClkDiv_to_CLKOUT = CLK_ATTACH_MUX(kCLOCK_SelCLKOUT, 5U),           /*!< Attach Pll1Clk to CLKOUT.    */
    kSLOW_CLK_to_CLKOUT   = CLK_ATTACH_MUX(kCLOCK_SelCLKOUT, 6U),           /*!< Attach SLOW_CLK to CLKOUT.   */
    kNONE_to_CLKOUT       = CLK_ATTACH_MUX(kCLOCK_SelCLKOUT, 7U),           /*!< Attach NONE to CLKOUT.       */

    kCPU_CLK_to_SYSTICK = CLK_ATTACH_MUX(kCLOCK_SelSYSTICK, 0U),            /*!< Attach CPU_CLK to SYSTICK. */
    kCLK_1M_to_SYSTICK  = CLK_ATTACH_MUX(kCLOCK_SelSYSTICK, 1U),            /*!< Attach CLK_1M to SYSTICK.  */
    kCLK_16K_to_SYSTICK = CLK_ATTACH_MUX(kCLOCK_SelSYSTICK, 2U),            /*!< Attach CLK_16K to SYSTICK. */
    kNONE_to_SYSTICK    = CLK_ATTACH_MUX(kCLOCK_SelSYSTICK, 3U),            /*!< Attach NONE to SYSTICK.    */

    kCLK_16K_to_WWDT1    = CLK_ATTACH_MUX(kCLOCK_SelWWDT1, 0U),             /*!< Attach CLK_16K to WWDT1.    */
    kFRO_HF_DIV_to_WWDT1 = CLK_ATTACH_MUX(kCLOCK_SelWWDT1, 1U),             /*!< Attach FRO_HF_DIV to WWDT1. */
    kCLK_1M_to_WWDT1     = CLK_ATTACH_MUX(kCLOCK_SelWWDT1, 2U),             /*!< Attach CLK_1M to WWDT1.     */

    kCLK_IN_to_TENBASET_PHY  = CLK_ATTACH_MUX(kCLOCK_SelTENBASET_PHY0, 3U), /*!< Attach CLK_IN to TENBASET_PHY.    */
    kPll1Clk_to_TENBASET_PHY = CLK_ATTACH_MUX(kCLOCK_SelTENBASET_PHY0, 6U), /*!< Attach Pll1Clk to TENBASET_PHY. */
    kNONE_to_TENBASET_PHY    = CLK_ATTACH_MUX(kCLOCK_SelTENBASET_PHY0, 7U), /*!< Attach NONE to TENBASET_PHY.     */

    kFRO_HF_to_ESPI     = CLK_ATTACH_MUX(kCLOCK_SelESPI0, 1U),              /*!< Attach FRO_HF to ESPI.     */
    kPll1ClkDiv_to_ESPI = CLK_ATTACH_MUX(kCLOCK_SelESPI0, 6U),              /*!< Attach Pll1ClkDiv to ESPI. */
    kNONE_to_ESPI       = CLK_ATTACH_MUX(kCLOCK_SelESPI0, 7U),              /*!< Attach NONE to ESPI.       */

    kFRO_HF_to_FLEXSPI  = CLK_ATTACH_MUX(kCLOCK_SelFLEXSPI0, 1),            /*!< Attach FRO_HF to FLEXSPI.  */
    kUSB_PFD_to_FLEXSPI = CLK_ATTACH_MUX(kCLOCK_SelFLEXSPI0, 4),            /*!< Attach USB_PFD to FLEXSPI. */
    kPll1Clk_to_FLEXSPI = CLK_ATTACH_MUX(kCLOCK_SelFLEXSPI0, 6),            /*!< Attach Pll1Clk to FLEXSPI. */
    kNONE_to_FLEXSPI    = CLK_ATTACH_MUX(kCLOCK_SelFLEXSPI0, 7),            /*!< Attach NONE to FLEXSPI.    */

    kFRO_LF_DIV_to_TSI0 = CLK_ATTACH_MUX(kCLOCK_SelTSI0, 0U),               /*!< Attach FRO_LF_DIV to TSI0. */
    kFRO_HF_DIV_to_TSI0 = CLK_ATTACH_MUX(kCLOCK_SelTSI0, 2U),               /*!< Attach FRO_HF_DIV to TSI0. */
    kCLK_IN_to_TSI0     = CLK_ATTACH_MUX(kCLOCK_SelTSI0, 3U),               /*!< Attach CLK_IN to TSI0.     */
    kCLK_1M_to_TSI0     = CLK_ATTACH_MUX(kCLOCK_SelTSI0, 5U),               /*!< Attach CLK_1M to TSI0.     */
    kPll1ClkDiv_to_TSI0 = CLK_ATTACH_MUX(kCLOCK_SelTSI0, 6U),               /*!< Attach Pll1ClkDiv to TSI0. */
    kNONE_to_TSI0       = CLK_ATTACH_MUX(kCLOCK_SelTSI0, 7U),               /*!< Attach NONE to TSI0.       */

    kCLK_IN_to_ENETRMII  = CLK_ATTACH_MUX(kCLOCK_SelRMII, 3U),              /*!< Attach CLK_IN to ENETRMII.  */
    kPll1Clk_to_ENETRMII = CLK_ATTACH_MUX(kCLOCK_SelRMII, 6U),              /*!< Attach Pll1Clk to ENETRMII. */
    kNONE_to_ENETRMII    = CLK_ATTACH_MUX(kCLOCK_SelRMII, 7U),              /*!< Attach NONE to ENETRMII.    */

    kCLK_IN_to_ENETPTPREF       = CLK_ATTACH_MUX(kCLOCK_SelE1588, 3U),      /*!< Attach LK_IN to ENETPTPREF.        */
    kENET0_TX_CLK_to_ENETPTPREF = CLK_ATTACH_MUX(kCLOCK_SelE1588, 4U),      /*!< Attach ENET0_TX_CLK to ENETPTPREF. */
    kPll1Clk_to_ENETPTPREF      = CLK_ATTACH_MUX(kCLOCK_SelE1588, 6U),      /*!< Attach Pll1Clk to ENETRMII.        */
    kNONE_to_ENETPTPREF         = CLK_ATTACH_MUX(kCLOCK_SelE1588, 7U),      /*!< Attach NONE to ENETPTPREF.         */

