zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/MCXA577/drivers/fsl_clock.h
    kNONE_to_NONE = (0xFFFFFFFFU),                                          /*!< Attach NONE to NONE. */

} clock_attach_id_t;

/*! @brief Clock dividers */
typedef enum _clock_div_name
{
    /* CLKDIV in MRCC */
    kCLOCK_DivI3C0_FCLK     = (0x104U + 0x800U), /*!< I3C0_FCLK     clock divider */
    kCLOCK_DivI3C1_FCLK     = (0x10CU + 0x800U), /*!< I3C1_FCLK     clock divider */
    kCLOCK_DivCTIMER0       = (0x114U + 0x800U), /*!< CTIMER0       clock divider */
    kCLOCK_DivCTIMER1       = (0x11CU + 0x800U), /*!< CTIMER1       clock divider */
    kCLOCK_DivCTIMER2       = (0x124U + 0x800U), /*!< CTIMER2       clock divider */
    kCLOCK_DivCTIMER3       = (0x12CU + 0x800U), /*!< CTIMER3       clock divider */
    kCLOCK_DivCTIMER4       = (0x134U + 0x800U), /*!< CTIMER4       clock divider */
    kCLOCK_DivWWDT0         = (0x13CU + 0x800U), /*!< WWDT0         clock divider */
    kCLOCK_DivWWDT1         = (0x144U + 0x800U), /*!< WWDT1         clock divider */
    kCLOCK_DivE1588         = (0x14CU + 0x800U), /*!< E1588         clock divider */
    kCLOCK_DivRMII          = (0x154U + 0x800U), /*!< RMII          clock divider */
    kCLOCK_DivESPI0         = (0x15CU + 0x800U), /*!< ESPI0         clock divider */
    kCLOCK_DivFLEXSPI0      = (0x164U + 0x800U), /*!< FLEXSPI0      clock divider */
    kCLOCK_DivLPSPI2        = (0x16CU + 0x800U), /*!< LPSPI2        clock divider */
    kCLOCK_DivLPSPI3        = (0x174U + 0x800U), /*!< LPSPI3        clock divider */
    kCLOCK_DivLPSPI4        = (0x17CU + 0x800U), /*!< LPSPI4        clock divider */
    kCLOCK_DivLPSPI5        = (0x184U + 0x800U), /*!< LPSPI5        clock divider */
    kCLOCK_DivTENBASET_PHY0 = (0x18CU + 0x800U), /*!< TENBASET_PHY0 clock divider */
    kCLOCK_DivUSBHS_PHY     = (0x19CU + 0x800U), /*!< USBHS_PHY      clock divider */
    kCLOCK_DivFLEXIO0       = (0x1A4U + 0x800U), /*!< FLEXIO0       clock divider */
    kCLOCK_DivLPI2C0        = (0x1ACU + 0x800U), /*!< LPI2C0        clock divider */
    kCLOCK_DivLPI2C1        = (0x1B4U + 0x800U), /*!< LPI2C1        clock divider */
    kCLOCK_DivLPSPI0        = (0x1BCU + 0x800U), /*!< LPSPI0        clock divider */
    kCLOCK_DivLPSPI1        = (0x1C4U + 0x800U), /*!< LPSPI1        clock divider */
    kCLOCK_DivI3C2_FCLK     = (0x1CCU + 0x800U), /*!< I3C2_FCLK     clock divider */
    kCLOCK_DivLPUART0       = (0x1D4U + 0x800U), /*!< LPUART0       clock divider */
    kCLOCK_DivLPUART1       = (0x1DCU + 0x800U), /*!< LPUART1       clock divider */
    kCLOCK_DivLPUART2       = (0x1E4U + 0x800U), /*!< LPUART2       clock divider */
    kCLOCK_DivLPUART3       = (0x1ECU + 0x800U), /*!< LPUART3       clock divider */
    kCLOCK_DivLPUART4       = (0x1F4U + 0x800U), /*!< LPUART4       clock divider */
    kCLOCK_DivLPTMR0        = (0x1FCU + 0x800U), /*!< LPTMR0        clock divider */
    kCLOCK_DivADC           = (0x20CU + 0x800U), /*!< ADCx          clock divider */
    kCLOCK_DivCMP0_FUNC     = (0x214U + 0x800U), /*!< CMP0_FUNC     clock divider */
    kCLOCK_DivCMP0_RR       = (0x21CU + 0x800U), /*!< CMP0_RR       clock divider */
    kCLOCK_DivDAC0          = (0x224U + 0x800U), /*!< DAC0          clock divider */
    kCLOCK_DivDAC1          = (0x22CU + 0x800U), /*!< DAC1          clock divider */
    kCLOCK_DivTSI0          = (0x234U + 0x800U), /*!< TSI0          clock divider */
    kCLOCK_DivFLEXCAN0      = (0x23CU + 0x800U), /*!< FLEXCAN0      clock divider */
    kCLOCK_DivFLEXCAN1      = (0x244U + 0x800U), /*!< FLEXCAN1      clock divider */
    kCLOCK_DivLPI2C2        = (0x24CU + 0x800U), /*!< LPI2C2        clock divider */
    kCLOCK_DivLPI2C3        = (0x254U + 0x800U), /*!< LPI2C3        clock divider */
    kCLOCK_DivLPI2C4        = (0x25CU + 0x800U), /*!< LPI2C4        clock divider */
    kCLOCK_DivLPUART5       = (0x264U + 0x800U), /*!< LPUART5       clock divider */
    kCLOCK_DivI3C3_FCLK     = (0x26CU + 0x800U), /*!< I3C3_FCLK     clock divider */
    kCLOCK_DivTRACE         = (0x274U + 0x800U), /*!< TRACE         clock divider */
    kCLOCK_DivCLKOUT        = (0x27CU + 0x800U), /*!< CLKOUT        clock divider */
    kCLOCK_DivSYSTICK       = (0x284U + 0x800U), /*!< SYSTICK       clock divider */

    /* CLKDIV in SYSCON */
    kCLOCK_DivSLOWCLK = (0x088U + 0x0U), /*!< SLOWCLK clock divider */
    kCLOCK_DivBUSCLK  = (0x084U + 0x0U), /*!< BUSCLK  clock divider */
    kCLOCK_DivAHBCLK  = (0x080U + 0x0U), /*!< AHBCLK  clock divider */
    kCLOCK_DivFRO_HF  = (0x090U + 0x0U), /*!< FROHF   clock divider */
    kCLOCK_DivFRO_LF  = (0x094U + 0x0U), /*!< FROLF   clock divider */
    kCLOCK_DivPLL1CLK = (0x0E4U + 0x0U), /*!< PLL1CLK clock divider */
} clock_div_name_t;

/*!< MAX clock divider */
#define kCLOCK_DivMax kCLOCK_DivSYSTICK

/*!
 * @brief FRO16K connection to each power domain.
 */
typedef enum _clke_16k
{
    kCLKE_16K_SYSTEM   = VBAT_FROCLKE_CLKE(1U), /*!< To VSYS domain.               */
    kCLKE_16K_COREMAIN = VBAT_FROCLKE_CLKE(2U), /*!< To VDD_CORE domain.           */
    kCLKE_16K_VBAT     = VBAT_FROCLKE_CLKE(4U), /*!< To VBAT domain.               */
    kCLKE_16K_ALL      = VBAT_FROCLKE_CLKE(7U)  /*!< To VSYS,VDD_CORE,VBAT domain. */
} clke_16k_t;

/*!
 * @brief SCG status return codes.
 */
enum _scg_status
{
    kStatus_SCG_Busy       = MAKE_STATUS(kStatusGroup_SCG, 1), /*!< Clock is busy.  */
    kStatus_SCG_InvalidSrc = MAKE_STATUS(kStatusGroup_SCG, 2)  /*!< Invalid source. */
};

/*!
 * @brief sirc trim mode.
 */
typedef enum _sirc_trim_mode
{
    kSCG_SircTrimNonUpdate = SCG_SIRCCSR_SIRCTREN_MASK,
    /*!< Trim enable but not enable trim value update. In this mode, the
     trim value is fixed to the initialized value which is defined by
     trimCoar and trimFine in configure structure \ref sirc_trim_mode_t.*/

    kSCG_SircTrimUpdate = SCG_SIRCCSR_SIRCTREN_MASK | SCG_SIRCCSR_SIRCTRUP_MASK
    /*!< Trim enable and trim value update enable. In this mode, the trim
     value is auto update. */

} sirc_trim_mode_t;

/*!
 * @brief sirc trim source.
 */
typedef enum _sirc_trim_src
{
    kNoTrimSrc             = 0, /*!< No external tirm source.    */
    kSCG_SircTrimSrcSysOsc = 2U /*!< System OSC.                 */
} sirc_trim_src_t;

/*!
 * @brief sirc trim configuration.
 */
typedef struct _sirc_trim_config
{
    sirc_trim_mode_t trimMode; /*!< Trim mode.       */
    sirc_trim_src_t trimSrc;   /*!< Trim source.     */
    uint16_t trimDiv;          /*!< Divider of SOSC. */
    uint8_t cltrim;            /*!< Trim coarse value; Irrelevant if trimMode is
                                  kSCG_TrimUpdate. */
    uint8_t ccotrim;           /*!< Trim fine value; Irrelevant if trimMode is
                                  kSCG_TrimUpdate. */
} sirc_trim_config_t;

/*!
 * @brief SCG system OSC monitor mode.
 */
typedef enum _scg_sosc_monitor_mode
{
    kSCG_SysOscMonitorDisable = 0U,                         /*!< Monitor disabled. */
    kSCG_SysOscMonitorInt     = SCG_SOSCCSR_SOSCCM_MASK,    /*!< Interrupt when the SOSC
                                                               error is detected. */
    kSCG_SysOscMonitorReset =
        SCG_SOSCCSR_SOSCCM_MASK | SCG_SOSCCSR_SOSCCMRE_MASK /*!< Reset when the SOSC error is detected. */
} scg_sosc_monitor_mode_t;

/*!
 * @brief SCG PLL1 monitor mode.
 */
typedef enum _scg_pll1_monitor_mode
{
    kSCG_Pll1MonitorDisable = 0U,                           /*!< Monitor disabled. */
    kSCG_Pll1MonitorInt     = SCG_SPLLCSR_SPLLCM_MASK,      /*!< Interrupt when the PLL1 Clock error is detected. */
    kSCG_Pll1MonitorReset =
        SCG_SPLLCSR_SPLLCM_MASK | SCG_SPLLCSR_SPLLCMRE_MASK /*!< Reset when the PLL1 Clock error is detected. */
} scg_pll1_monitor_mode_t;

/*!
 * @brief The active run mode (voltage level).
 */
typedef enum _run_mode
{
    kMD_Mode, /*!< Middle driver mode, VDD_CORE: 1.0V   */
    kSD_Mode, /*!< Standard driver mode,VDD_CORE: 1.1V  */
    kOD_Mode, /*!< Over drive mode, VDD_CORE: 1.2V      */
} run_mode_t;

/*! @brief OSC32K clock gate */
typedef enum _osc32k_clk_gate_id
{
    kCLOCK_Osc32kToSys  = 0x1, /*!< OSC32K[0] to SYSTEM domain. */
    kCLOCK_Osc32kToCore = 0x2, /*!< OSC32K[1] to CORE domain.   */
    kCLOCK_Osc32kToVbat = 0x4, /*!< OSC32K[2] to VBAT domain.  */
    kCLOCK_Osc32kToAll  = 0x7, /*!< OSC32K to SYSTEM,CORE,VBAT domain. */
} osc32k_clk_gate_id_t;

/*!
 * @brief The enumerator of internal capacitance of OSC's XTAL pin.
 */
typedef enum _vbat_osc_xtal_cap
{
    kVBAT_OscXtal0pFCap  = 0x0U, /*!< The internal capacitance for XTAL pin is 0pF. */
    kVBAT_OscXtal2pFCap  = 0x1U, /*!< The internal capacitance for XTAL pin is 2pF. */
    kVBAT_OscXtal4pFCap  = 0x2U, /*!< The internal capacitance for XTAL pin is 4pF. */
    kVBAT_OscXtal6pFCap  = 0x3U, /*!< The internal capacitance for XTAL pin is 6pF. */
    kVBAT_OscXtal8pFCap  = 0x4U, /*!< The internal capacitance for XTAL pin is 8pF. */
    kVBAT_OscXtal10pFCap = 0x5U, /*!< The internal capacitance for XTAL pin is 10pF. */
    kVBAT_OscXtal12pFCap = 0x6U, /*!< The internal capacitance for XTAL pin is 12pF. */
    kVBAT_OscXtal14pFCap = 0x7U, /*!< The internal capacitance for XTAL pin is 14pF. */
    kVBAT_OscXtal16pFCap = 0x8U, /*!< The internal capacitance for XTAL pin is 16pF. */
    kVBAT_OscXtal18pFCap = 0x9U, /*!< The internal capacitance for XTAL pin is 18pF. */
    kVBAT_OscXtal20pFCap = 0xAU, /*!< The internal capacitance for XTAL pin is 20pF. */
    kVBAT_OscXtal22pFCap = 0xBU, /*!< The internal capacitance for XTAL pin is 22pF. */
    kVBAT_OscXtal24pFCap = 0xCU, /*!< The internal capacitance for XTAL pin is 24pF. */
    kVBAT_OscXtal26pFCap = 0xDU, /*!< The internal capacitance for XTAL pin is 26pF. */
    kVBAT_OscXtal28pFCap = 0xEU, /*!< The internal capacitance for XTAL pin is 28pF. */
    kVBAT_OscXtal30pFCap = 0xFU, /*!< The internal capacitance for XTAL pin is 30pF. */
} vbat_osc_xtal_cap_t;

/*!
 * @brief The enumerator of internal capacitance of OSC's EXTAL pin.
 */
typedef enum _vbat_osc_extal_cap
{
    kVBAT_OscExtal0pFCap  = 0x0U, /*!< The internal capacitance for EXTAL pin is 0pF. */
    kVBAT_OscExtal2pFCap  = 0x1U, /*!< The internal capacitance for EXTAL pin is 2pF. */
    kVBAT_OscExtal4pFCap  = 0x2U, /*!< The internal capacitance for EXTAL pin is 4pF. */
    kVBAT_OscExtal6pFCap  = 0x3U, /*!< The internal capacitance for EXTAL pin is 6pF. */
    kVBAT_OscExtal8pFCap  = 0x4U, /*!< The internal capacitance for EXTAL pin is 8pF. */
    kVBAT_OscExtal10pFCap = 0x5U, /*!< The internal capacitance for EXTAL pin is 10pF. */
    kVBAT_OscExtal12pFCap = 0x6U, /*!< The internal capacitance for EXTAL pin is 12pF. */
    kVBAT_OscExtal14pFCap = 0x7U, /*!< The internal capacitance for EXTAL pin is 14pF. */
    kVBAT_OscExtal16pFCap = 0x8U, /*!< The internal capacitance for EXTAL pin is 16pF. */
    kVBAT_OscExtal18pFCap = 0x9U, /*!< The internal capacitance for EXTAL pin is 18pF. */
    kVBAT_OscExtal20pFCap = 0xAU, /*!< The internal capacitance for EXTAL pin is 20pF. */
    kVBAT_OscExtal22pFCap = 0xBU, /*!< The internal capacitance for EXTAL pin is 22pF. */
    kVBAT_OscExtal24pFCap = 0xCU, /*!< The internal capacitance for EXTAL pin is 24pF. */
    kVBAT_OscExtal26pFCap = 0xDU, /*!< The internal capacitance for EXTAL pin is 26pF. */
    kVBAT_OscExtal28pFCap = 0xEU, /*!< The internal capacitance for EXTAL pin is 28pF. */
    kVBAT_OscExtal30pFCap = 0xFU, /*!< The internal capacitance for EXTAL pin is 30pF. */
} vbat_osc_extal_cap_t;

/*!
 * @brief The enumerator of osc amplifier gain fine adjustment.
 * Changes the oscillator amplitude by modifying the automatic gain control (AGC).
 */
typedef enum _vbat_osc_fine_adjustment_value
{
    kVBAT_OscCoarseAdjustment05 = 0U,
    kVBAT_OscCoarseAdjustment10 = 1U,
    kVBAT_OscCoarseAdjustment18 = 2U,
    kVBAT_OscCoarseAdjustment33 = 3U,
} vbat_osc_coarse_adjustment_value_t;

/*!
 * @brief The structure of oscillator configuration.
 */
typedef struct _vbat_osc_config
{
    bool enableInternalCapBank;         /*!< enable/disable the internal capacitance bank. */

    bool enableCrystalOscillatorBypass; /*!< enable/disable the crystal oscillator bypass. */

    vbat_osc_xtal_cap_t xtalCap;        /*!< The internal capacitance for the OSC XTAL pin from the capacitor bank,
                                                  only useful when the internal capacitance bank is enabled. */
    vbat_osc_extal_cap_t extalCap; /*!< The internal capacitance for the OSC EXTAL pin from the capacitor bank, only
                                      useful when the internal capacitance bank is enabled. */
    vbat_osc_coarse_adjustment_value_t
        coarseAdjustment;          /*!< 32kHz crystal oscillator amplifier coarse adjustment value. */
} vbat_osc_config_t;

/*!
 * @brief The enumerator of Initialization Trim.
 */
typedef enum _vbat_osc_init_trim
{
    kVBAT_OscInitTrim8000ms = 0x0U, /*!< Configures the start-up time of the oscillator to 8s. */
    kVBAT_OscInitTrim4000ms = 0x1U, /*!< Configures the start-up time of the oscillator to 4s. */
    kVBAT_OscInitTrim2000ms = 0x2U, /*!< Configures the start-up time of the oscillator to 2s. */
    kVBAT_OscInitTrim1000ms = 0x3U, /*!< Configures the start-up time of the oscillator to 1s. */
    kVBAT_OscInitTrim500ms  = 0x4U, /*!< Configures the start-up time of the oscillator to 0.5s. */
    kVBAT_OscInitTrim250ms  = 0x5U, /*!< Configures the start-up time of the oscillator to 0.25s. */
    kVBAT_OscInitTrim125ms  = 0x6U, /*!< Configures the start-up time of the oscillator to 0.125s. */
    kVBAT_OscInitTrimHalfms = 0x7U, /*!< Configures the start-up time of the oscillator to 0.5ms. */
} vbat_osc_init_trim_t;

/*!
 * @brief The enumerator of Capacitor Trim.
 */
typedef enum _vbat_osc_cap_trim
{
    kVBAT_OscCapTrimDefault    = 0x0U,
    kVBAT_OscCapTrim1us        = 0x1U,
    kVBAT_OscCapTrim2us        = 0x2U,
    kVBAT_OscCapTrim2andhalfus = 0x3U,
} vbat_osc_cap_trim_t;

/*!
 * @brief The enumerator of Delay Trim.
 */
typedef enum _vbat_osc_dly_trim
{
    kVBAT_OscDlyTrim0 = 0x0U, /*!< P current 9(nA) and N Current 6(nA). */
    kVBAT_OscDlyTrim1 = 0x1U, /*!< P current 13(nA) and N Current 6(nA). */
    kVBAT_OscDlyTrim3 = 0x3U, /*!< P current 4(nA) and N Current 6(nA). */
    kVBAT_OscDlyTrim4 = 0x4U, /*!< P current 9(nA) and N Current 4(nA). */
    kVBAT_OscDlyTrim5 = 0x5U, /*!< P current 13(nA) and N Current 4(nA). */
    kVBAT_OscDlyTrim6 = 0x6U, /*!< P current 4(nA) and N Current 4(nA). */
    kVBAT_OscDlyTrim7 = 0x7U, /*!< P current 9(nA) and N Current 2(nA). */
    kVBAT_OscDlyTrim8 = 0x8U, /*!< P current 13(nA) and N Current 2(nA). */
    kVBAT_OscDlyTrim9 = 0x9U, /*!< P current 4(nA) and N Current 2(nA). */
} vbat_osc_dly_trim_t;

/*!
 * @brief The enumerator of CAP2_TRIM.
 */
typedef enum _vbat_osc_cap2_trim
{
    kVBAT_OscCap2Trim0 = 0x0U,
    kVBAT_OscCap2Trim1 = 0x1U,
} vbat_osc_cap2_trim_t;

/*!
 * @brief The enumerator of Comparator Trim.
 */
typedef enum _vbat_osc_cmp_trim
{
    kVBAT_OscCmpTrim760mv = 0x0U,
    kVBAT_OscCmpTrim770mv = 0x1U,
    kVBAT_OscCmpTrim740mv = 0x3U,
} vbat_osc_cmp_trim_t;

/*!
 * @brief The enumerator of configures Crystal Oscillator mode..
 */
typedef enum _vbat_osc_mode_en
{
    kVBAT_OscNormalModeEnable   = 0x0U,
    kVBAT_OscStartupModeEnable  = 0x1U,
    kVBAT_OscLowpowerModeEnable = 0x3U,
} vbat_osc_mode_en_t;

/*!
 * @brief The structure of oscillator configuration.
 */
typedef struct _osc_32k_config
{
    vbat_osc_init_trim_t initTrim;
    vbat_osc_cap_trim_t capTrim;
    vbat_osc_dly_trim_t dlyTrim;
    vbat_osc_cap2_trim_t cap2Trim;
    vbat_osc_cmp_trim_t cmpTrim;

